Show / Hide Table of Contents
Class InformationMessage
Open Information message
Inheritance
System.Object
OpenObject
OpenMessage
InformationMessage
Inherited Members
 OpenMessage.Create(MessageNumber, OpenObject, String, String, OpenMessage)
 OpenMessage.Number
 OpenMessage.InnerMessage
 OpenMessage.Description
 OpenMessage.Object
 OpenMessage.PropertyName
 OpenMessage.PropertyValue
 System.Object.ToString()
 System.Object.Equals(System.Object)
 System.Object.Equals(System.Object, System.Object)
 System.Object.ReferenceEquals(System.Object, System.Object)
 System.Object.GetHashCode()
 System.Object.GetType()
 System.Object.MemberwiseClone()
Namespace: IdeaRS.OpenModel.Message
Assembly: IdeaRS.OpenModel.dll
Syntax
[Obfuscation(Feature = "renaming")]
[DataContract]
public class InformationMessage : OpenMessage
Constructors
Improve this Doc   View Source
InformationMessage()
Constructor
Declaration
public InformationMessage()
Properties
Improve this Doc   View Source
Message
Gets the Message
Declaration
public override string Message { get; }
Property Value
 Type |  Description
 System.String
Overrides
OpenMessage.Message
 Improve this Doc
 View Source